{
  "title": "Omnipotent Reader’s Viewpoint",
  "author": "king kong",
  "description": "A bored office worker finds himself trapped inside the webnovel he’s been reading for years — except this time, he’s not the hero, but the only one who knows how the story ends.",
  "status": "Ongoing",
  "image": "../../img/Novel-3.png",
  "genre": "Fantasy, Magic, Action",
  "chapters": [
    {
      "number": 0,
      "title": "Prologue — The End of the Story",
      "content": "The subway rocked gently as the announcement droned overhead. Another late night, another empty carriage.\n\nI stared at my phone, the glow of the screen reflecting in my tired eyes. The final chapter of my favorite webnovel, *Three Ways to Survive in a Ruined World*, had just been uploaded. Ten years, three thousand chapters, and now it was ending.\n\nNo one else had ever read it — not a single comment besides mine. But to me, it was everything.\n\nI tapped the final line.\n\n> 'And so, the world was saved — by the one who knew its end.'\n\nThe lights flickered.\n\nWhen they came back on, the carriage was empty. My phone buzzed once more. A new notification appeared on the screen.\n\n> [Main Scenario #1 — Survival Begins]\n\nThen the train derailed, and the world went dark."
    },
    {
      "number": 1,
      "title": "The World I Read About",
      "content": "I woke up in the wreckage, surrounded by silence. The metal walls were torn open, moonlight streaming through broken glass. My phone was still in my hand — cracked, but glowing.\n\n> [You are a participant in the scenario.]\n\nI laughed. I couldn’t help it. It was the same line that opened chapter one of the novel.\n\nThis was impossible.\n\nBut when I stepped outside, I saw it — the same monsters from the story crawling through the streets, the same burning sky, the same screams.\n\nAnd in that moment, I understood something terrifying.\n\nI wasn’t a reader anymore.\n\nI was inside the book."
    },
    {
      "number": 2,
      "title": "A Reader’s Advantage",
      "content": "Panic spread quickly. People ran, screamed, begged for help — but I knew what would happen next. I’d read this scene a hundred times.\n\nThe monsters would appear in groups of three. The first would come from the east tunnel. The only way to survive was to hide before the second wave.\n\nI moved before anyone else. While they froze, I dove behind a fallen seat, pulling a stranger down with me. A heartbeat later, a claw tore through the air where we’d been standing.\n\nThe man stared at me, trembling. “How did you know?”\n\nI forced a smile. “I read ahead.”"
    },
    {
      "number": 3,
      "title": "The Stream of Scenarios",
      "content": "Night fell, and with it came the first broadcast. A blinding light split the sky, forming words across the clouds.\n\n> [Welcome, survivors.]\n\nEveryone screamed. I just sighed. I already knew what came next — the trials, the hunts, the betrayals. It was all part of the script.\n\nBut reading it and living it were two different things.\n\nI’d always imagined myself as the main character, but now I understood what the author meant when he wrote that this world had no heroes — only survivors.\n\nStill, I had something no one else did.\n\nKnowledge.\n\nAnd knowledge was power."
    },
    {
      "number": 4,
      "title": "The One Who Knows Too Much",
      "content": "By the third day, I had already saved more people than I could count. Some called it luck. Others whispered that I was a prophet.\n\nIf only they knew.\n\nThe truth was simple: I remembered everything that would happen because I’d already read it. Every monster, every event, every betrayal.\n\nBut the more I interfered, the more things started to change.\n\nCharacters who should have died survived. Events that never existed began appearing.\n\nThe story was rewriting itself around me — and I was no longer sure I was still in control."
    },
    {
      "number": 5,
      "title": "The Author’s Shadow",
      "content": "It happened when I opened my phone again. A new message blinked on the cracked screen.\n\n> [A new chapter has been uploaded.]\n\nThat couldn’t be right. The story had ended. But there it was — *Chapter 3001: The Reader Who Knows Everything.*\n\nMy heart stopped.\n\nThe chapter described me, word for word — every decision I’d made since waking up here.\n\nAnd at the end, one line burned itself into my vision.\n\n> 'The author watches from the other side.'"
    },
    {
      "number": 6,
      "title": "When Fiction Fights Back",
      "content": "The world began to glitch.\n\nBuildings flickered between states of ruin and perfection. People repeated the same words, their faces flickering like broken screens.\n\nI realized something: this wasn’t just a world based on the novel — it *was* the novel, reacting to my interference.\n\nEvery time I changed something, the story tried to correct itself.\n\nAnd it wasn’t happy about it."
    },
    {
      "number": 7,
      "title": "The Character Who Shouldn’t Exist",
      "content": "Her name was Mira.\n\nShe wasn’t supposed to be here — I knew every character in this world, and she wasn’t one of them.\n\nYet there she was, saving people, fighting monsters, defying every line I remembered.\n\nWhen I asked who she was, she smiled faintly.\n\n“I’m what happens when a reader changes the story.”\n\nHer eyes glowed faintly blue, and for the first time, I felt fear. Not of the monsters — but of what I’d created."
    },
    {
      "number": 8,
      "title": "The Choice That Changes Everything",
      "content": "The next scenario began.\n\n> [Main Scenario #3 — Sacrifice One to Save Many]\n\nI knew this one. In the original story, the protagonist sacrificed himself so that the others could escape. But that was fiction. This was real.\n\nAnd I wasn’t ready to die.\n\nAs the countdown began, I looked around at the survivors — people who now followed me, believed in me. They were waiting for my answer.\n\nIf I did nothing, they’d all die. If I followed the story, I’d die.\n\nFor the first time, I made a choice the author hadn’t written.\n\nI chose someone else."
    },
    {
      "number": 9,
      "title": "The Price of Knowledge",
      "content": "The world didn’t reset this time.\n\nInstead, the sky cracked, splitting open to reveal lines of text — words rewriting reality in real time.\n\n> [Deviation Detected.]\n> [Correcting Narrative.]\n\nPain exploded in my skull. Memories twisted, scenes overlapped, and the story began to collapse. I saw every possibility, every ending, all at once.\n\nWhen I could finally breathe again, Mira was gone.\n\nAll that remained was her voice.\n\n> “You can’t read a story without becoming part of it.”"
    },
    {
      "number": 10,
      "title": "The Collapse of the Script",
      "content": "Cities froze in midair. Rivers flowed backward. The sky itself began to unravel like torn pages.\n\nThe author was rewriting the story from the other side — erasing everything I’d changed.\n\nI tried to fight it. I wrote new words, scrawling them across walls, across screens, across my own skin.\n\nBut the text consumed everything.\n\n> [There is only one author.]\n\nAnd in the next moment, I was gone."
    },
    {
      "number": 11,
      "title": "The Reader Between Worlds",
      "content": "When I opened my eyes, I was in a void made of floating words. Sentences drifted past me like stars, each one a memory from the story.\n\nIn the distance, I saw a desk — and behind it, someone writing.\n\nThe author.\n\nHe looked up and smiled. “I wondered when you’d catch up.”\n\nI took a step forward. “You’re controlling everything.”\n\nHe shook his head. “No. I just write it. You’re the one who makes it real.”"
    },
    {
      "number": 12,
      "title": "The Rewrite",
      "content": "The author slid a blank page toward me. “If you want to change the ending,” he said, “write it yourself.”\n\nThe pen felt heavy in my hand. My heart pounded as I realized what he meant.\n\nThis was my story now.\n\nI began to write.\n\nWords appeared in the air, shaping the world around me — cities rebuilding, people returning, Mira standing beside me again.\n\nThe author watched quietly. When I looked up, he was gone.\n\nAll that remained were his final words, written in the corner of the page.\n\n> 'Every reader becomes an author eventually.'"
    },
    {
      "number": 13,
      "title": "The Final Chapter",
      "content": "Everything was ending again.\n\nThe world trembled as the last line appeared across the sky.\n\n> [Main Scenario #10 — The Author Dies.]\n\nI laughed. It was the only thing left to do.\n\nIf this was how the story ended, then so be it. But before the light consumed me, I added one more line — one the system wouldn’t see.\n\n> 'A story only ends when it’s forgotten.'"
    },
    {
      "number": 14,
      "title": "Epilogue — The Reader’s Viewpoint",
      "content": "I woke up on the subway.\n\nThe carriage rocked gently, the lights flickering just like before. My phone was in my hand. The app was open.\n\nBut there were no chapters anymore — only a single line of text.\n\n> 'Thank you for reading.'\n\nI closed my eyes and smiled. Maybe it was all a dream. Maybe it wasn’t.\n\nAs the train doors opened, a familiar voice whispered from behind me.\n\n> “The next story is yours.”"
    }
  ]
}
