{
  "title": "Leveling Alone",
  "author": "Hypothetical Author",
  "description": "A weak hunter left behind by the world gains a mysterious system that lets him grow stronger — but every level comes with a price.",
  "status": "Ongoing",
  "image": "../../img/Novel-5.png",
  "genre": "Action, Fantasy, Adventure, System, Dungeons",
  "chapters": [
    {
      "number": 0,
      "title": "Prologue — The Weakest Hunter",
      "content": "They called me the weakest hunter.\n\nE-rank, bottom of the ladder. The kind of guy people brought along to carry potions or clear traps. Every raid, I was the first to bleed and the last to be thanked. But I didn’t complain. In a world where monsters walked the earth, even the weakest hunter was still better than being ordinary.\n\nThat’s what I kept telling myself.\n\nUntil that day.\n\nThe dungeon gate appeared in the middle of downtown Seoul — black and rippling like oil. Every guild wanted the credit for clearing it, but when the higher ranks didn’t return, the Association sent us — a patchwork team of leftovers. E-ranks and D-ranks. Cannon fodder.\n\nThe air inside was cold. The moment I stepped through, I felt something watching me.\n\nThe deeper we went, the quieter it got. No monsters. No loot. Just silence.\n\nThen we found the statues.\n\nA hundred stone giants lined the walls, each holding a weapon. They stared down at us with empty eyes. At the end of the hall stood one larger than the rest — a god carved from obsidian, smiling.\n\nSomeone laughed nervously. “Creepy, huh?”\n\nThat’s when the doors slammed shut.\n\nAnd the god opened its eyes."
    },
    {
      "number": 1,
      "title": "The Dungeon That Kills",
      "content": "The first scream came from the archer. The next from the healer. The statues moved, grinding stone against stone as they raised their weapons. Arrows shattered against their bodies. Magic fizzled uselessly.\n\nThe commandment appeared in midair — glowing letters in a language none of us understood.\n\n> [Bow before God.]\n\nA few of us dropped to our knees. I hesitated — and the hunter beside me was crushed under a stone club. Blood painted the floor.\n\nWe obeyed.\n\nEvery command came with new horror.\n\n> [Praise God.]\n> [Sing for God.]\n> [Sacrifice for God.]\n\nOne by one, my teammates died — screaming, begging, praying. I should’ve died too. But when the final command appeared, something inside me broke.\n\n> [Survive.]\n\nThe statues froze. The god smiled.\n\n> [You are chosen.]\n\nThen the world went dark."
    },
    {
      "number": 2,
      "title": "The System Awakens",
      "content": "I woke up in a hospital bed, drenched in sweat. The doctors said I was the only survivor of the C-rank gate incident. The rest of the team — gone. My body was covered in cuts and burns, yet somehow, I was alive.\n\nThe Association wanted answers. I had none.\n\nThat night, when the lights went out, a sound echoed in my head.\n\n> [Initializing system...]\n> [Welcome, Player.]\n\nA blue screen appeared before my eyes, flickering like a dream.\n\n> [You have met the requirements to awaken the System.]\n\nI thought I was hallucinating. But when I reached out, my hand passed through the words — and something clicked inside me.\n\nA list of stats appeared:\n\n> Strength: 10\n> Agility: 9\n> Vitality: 11\n> Intelligence: 8\n> Sense: 7\n\nAnd beneath them — a quest.\n\n> [Daily Quest: Train or Die.]\n> Push-ups: 0/100\n> Sit-ups: 0/100\n> Squats: 0/100\n> Run: 10 km\n\n> Reward: +3 Stat Points\n> Penalty for Failure: Death.\n\nI laughed. Then I realized the window wouldn’t close.\n\nAnd my heart went cold."
    },
    {
      "number": 3,
      "title": "The Daily Quest from Hell",
      "content": "At first, I thought it was a joke.\n\nI ignored the quest and went back to sleep.\n\nWhen I woke up, I couldn’t move. My body screamed in agony, my skin burning as invisible chains bound me to the bed. A cold voice whispered in my mind.\n\n> [Penalty Zone Activated.]\n\nThe world shifted. I was standing in a wasteland filled with corpses and shadows that reached for me from the dark.\n\nI ran.\n\nEvery step felt like fire tearing through my lungs. When I fell, they clawed at my legs, pulling me under.\n\n> [Quest Failed.]\n> [Retrying...]\n\nI woke up screaming.\n\nAfter that, I didn’t skip another quest."
    },
    {
      "number": 4,
      "title": "The Path of Power",
      "content": "Weeks passed. Every morning, I completed the same brutal routine — push-ups, sit-ups, running until I collapsed. My stats grew slowly, but the changes were real. I could lift more, move faster, see farther. The weak E-rank who could barely hold a dagger was gone.\n\nWhen the next gate appeared, I joined the raid — not as bait, but as a fighter.\n\nThe others laughed when they saw my rank.\n\nThey weren’t laughing when I split a goblin in half with one strike.\n\nAfter that day, rumors started spreading. About an E-rank hunter who fought like an A-rank. About a survivor who returned from a dungeon that killed everyone else.\n\nI didn’t care about fame. I only cared about one thing.\n\n> Level up."
    },
    {
      "number": 5,
      "title": "The Hunter’s Secret",
      "content": "Each kill brought more strength. Each victory fed the system inside me. But something else came with it — whispers in the dark, flickering words that only I could see.\n\n> [You are breaking the balance.]\n> [Stop, or be stopped.]\n\nThe more I grew, the more I realized this system wasn’t a gift. It was a chain.\n\nOne night, I received a quest unlike any before.\n\n> [Hidden Quest: Enter the Double Dungeon.]\n\nMy instincts screamed at me to refuse.\n\nBut the promise of greater power was too much to ignore."
    },
    {
      "number": 6,
      "title": "The Double Dungeon",
      "content": "The entrance looked ordinary — just another low-rank gate inside an abandoned subway. But as soon as I stepped inside, I knew it was different.\n\nThe walls breathed.\n\nEvery sound echoed too long, too deep. The deeper I went, the louder my heartbeat became. When I reached the end, the door closed behind me.\n\nAnd the system spoke.\n\n> [You have entered the Trial of the Shadow Monarch.]\n\nThe air turned black. The ground cracked open. From the darkness rose a figure wearing armor darker than night.\n\n> [Kneel.]\n\nI couldn’t move. Every cell in my body screamed in terror. The figure raised its sword — and struck.\n\nWhen I woke, I was still alive.\n\n> [You have inherited a fragment of power.]\n\nMy shadow moved on its own."
    },
    {
      "number": 7,
      "title": "The Shadow Within",
      "content": "At first, I thought I was imagining it — my shadow stretching, twitching, moving out of sync with me. But one night, it spoke.\n\n> 'Do you want strength?'\n\nI froze.\n\nThe voice came from beneath me, low and calm, yet full of something ancient. I didn’t answer. It didn’t need me to.\n\nThe next time I entered a gate, I lost my weapon. Cornered, bleeding, desperate — and then, the shadow moved.\n\nIt rose from the ground, took my form, and slaughtered the monsters for me.\n\nWhen it was over, it bowed.\n\n> 'We are one now.'"
    },
    {
      "number": 8,
      "title": "The Monarch’s Power",
      "content": "The more I fought, the more I understood what the power inside me truly was. It wasn’t magic. It wasn’t skill. It was authority — the ability to command shadows, to turn death itself into my army.\n\nEvery monster I killed rose again at my call.\n\nHunters began to fear me. Guilds offered contracts I didn’t need. Reporters called me the Shadow Hunter.\n\nBut none of them knew the truth.\n\nEach time I used this power, I felt something else inside me stir — a presence buried deep beneath my skin, whispering to take more, consume more.\n\nAnd I didn’t know if I could resist it forever."
    },
    {
      "number": 9,
      "title": "The Hunter’s Guild",
      "content": "Power brings attention. Attention brings danger.\n\nThe Hunter’s Guild sent their best after me — not to fight, but to recruit. They called me a 'valuable asset'. I called them vultures.\n\nStill, I played along. Inside their walls, I learned more about the world’s secrets — about gates, mana, and the existence of Monarchs. Creatures said to rule over all.\n\nThe words sent a chill through me.\n\nThe system had called my trial 'The Trial of the Shadow Monarch.'\n\nWas it a coincidence? Or a warning?"
    },
    {
      "number": 10,
      "title": "The Monarch’s Awakening",
      "content": "It began as a nightmare — a battlefield of endless darkness, shadows tearing each other apart. At the center stood the same armored figure from the double dungeon.\n\n> 'My successor,' it said. 'Our power cannot be divided forever.'\n\nI reached out, and the world shattered. When I woke up, the system had changed.\n\n> [New Title Acquired: Monarch of Shadows]\n\nThe weight of it nearly crushed me. But beneath it all, I felt something else — hunger. Endless, consuming hunger.\n\nAnd for the first time, I didn’t fear it."
    },
    {
      "number": 11,
      "title": "The War of Monarchs",
      "content": "Gates began appearing faster. Cities fell one after another. The news called it a crisis. I called it a beginning.\n\nThe Monarchs had awakened.\n\nEach one ruled an element — frost, beasts, destruction, shadows. They didn’t see humans as enemies. They saw us as pawns.\n\nThe system had given me power, but not without purpose. I wasn’t meant to serve the Monarchs.\n\nI was meant to fight them."
    },
    {
      "number": 12,
      "title": "The Shadow Army",
      "content": "I raised my army beneath the earth.\n\nThousands of shadows, once monsters, now my soldiers. They obeyed without question, without hesitation.\n\nEvery night, I felt their presence through the bond that tied us. Every kill they made flowed back into me like cold fire.\n\nBut power always attracts attention.\n\nThe Monarchs were watching.\n\nAnd one of them was coming."
    },
    {
      "number": 13,
      "title": "The Battle for Humanity",
      "content": "The sky turned black.\n\nWhen the Frost Monarch descended, the air froze mid-breath. My shadow army rose behind me, their eyes glowing faint blue in the dark.\n\nWe clashed in silence — frost against shadow, creation against death. The world cracked under our feet.\n\nI realized then that humanity had never been part of the equation. This war wasn’t for survival.\n\nIt was for dominion."
    },
    {
      "number": 14,
      "title": "Epilogue — The King of Shadows",
      "content": "When the dust settled, the world was quiet again.\n\nThe gates had closed. The monsters were gone. But the cities lay in ruins, and the hunters who survived looked at me not with gratitude, but fear.\n\nI didn’t blame them. I wasn’t one of them anymore.\n\nIn the reflection of a shattered window, I saw my eyes glowing faint violet. My shadow moved behind me, smiling.\n\n> 'We are one now.'\n\nThe age of hunters had ended.\n\nAnd the era of shadows had begun."
    }
  ]
}
