{
  "title": "Restarting From Zero",
  "author": "tappa123",
  "description": "Thrown into a world that resets every time he dies, a boy learns that hope is both his greatest weapon and his cruelest curse.",
  "status": "Ongoing",
  "image": "../../img/Novel-2.png",
  "genre": "Fantasy, Magic, Comedy",
  "chapters": [
    {
      "number": 0,
      "title": "Prologue",
      "content": "The first time I died, it didn’t feel real.\n\nThe sky had been clear — too clear — and the air smelled faintly of flowers. I remembered walking out of the small store near the station, a plastic bag swinging from my hand, when the world twisted.\n\nA flash of light, a sound like glass breaking, and suddenly I was standing in a cobblestone street lined with stalls and shouting merchants.\n\nIt wasn’t Japan. It wasn’t anywhere I knew.\n\nI stumbled forward, my phone flickering uselessly in my hand. No signal. No service. Only strange faces, strange clothes, and a strange language I somehow understood.\n\nWhen the panic finally passed, I thought maybe it was a dream. Then I heard the scream.\n\nBy the time I reached the alley, the girl was already gone — blood staining the walls, her pendant lying in a puddle at my feet. I picked it up without thinking.\n\nAnd that’s when everything went black.\n\nWhen I opened my eyes again, I was back on the street, the plastic bag still swinging from my hand.\n\nThe same clear sky. The same smell of flowers.\n\nI hadn’t imagined it.\n\nI had died — and returned."
    },
    {
      "number": 1,
      "title": "The First Reset",
      "content": "I stood there, frozen, the plastic bag trembling in my grip. Everything looked identical — the people, the sounds, even the same man shouting about discounted bread.\n\nMy heart pounded. The memory of the alley was still too vivid — the girl’s voice, the blood, the coldness spreading through my chest. It wasn’t a dream.\n\nI ran back to the same street, hoping to prove myself wrong, but when I reached the alley, there was nothing. No girl, no blood, not even a stain. Only the pendant in my pocket — the one that shouldn’t exist.\n\nI stared at it for a long time. Then I laughed — a short, broken laugh that didn’t sound like mine.\n\nIf this really was another world, then maybe it followed another set of rules.\n\nBut one thing was clear.\n\nIf I wanted to survive here, I needed to understand what was happening — and why I was the only one who remembered dying."
    },
    {
      "number": 2,
      "title": "A World That Moves Without Me",
      "content": "Days passed — or maybe it was the same day repeating over and over. I couldn’t tell anymore. Each time I tried to change something, the world shifted around me as if mocking the effort.\n\nI met people who smiled, who talked, who promised to help. Then, one mistake later, they vanished — and I woke up at the same spot, holding the same plastic bag.\n\nThe resets didn’t hurt anymore. But the silence after each one did.\n\nIt was like screaming into an empty world that only pretended to listen.\n\nThen, one night, I saw her again — the girl from the alley. She was alive, walking through the market with a small pouch of herbs. I followed from a distance, terrified that if I spoke to her, I’d trigger another death.\n\nBut when she turned around and smiled at me, my heart stopped.\n\nShe knew me.\n\nShe shouldn’t have — but she did."
    },
    {
      "number": 3,
      "title": "The Girl with Silver Eyes",
      "content": "Her name was Elyne.\n\nShe said she’d seen me before, in another loop — though she didn’t call it that. To her, it was a dream that kept repeating, fragments she could barely remember. But somehow, she knew I wasn’t from this world.\n\nWhen she touched the pendant, it glowed faintly, the same way it did before my first death. A strange symbol shimmered across her hand — a circle with a single, broken wing.\n\nShe told me it was a mark of fate. That it bound our lives together.\n\nI wanted to ask her what that meant, but before I could, the air turned cold. The sky darkened, and something heavy filled the street — an unseen presence pressing against my chest.\n\nPeople froze mid-step. The bells stopped ringing. The world itself seemed to hold its breath.\n\nElyne grabbed my arm. \"Run,\" she said.\n\nAnd I did."
    },
    {
      "number": 4,
      "title": "The Shadow That Hunts",
      "content": "We didn’t make it far.\n\nA shape emerged from the mist — tall, shrouded, its face hidden beneath a hood that swallowed light. Every step it took bent the air around it, twisting sound into silence. Elyne whispered a prayer under her breath.\n\nIt turned its head toward us.\n\nThere were no eyes, only darkness.\n\nI reached for a weapon I didn’t have, but Elyne lifted her hand, the pendant’s light flaring in her palm. The shadow hissed, shrinking back.\n\nThen it lunged.\n\nEverything went white. I felt the world spin, the weight leave my body, and as the cold closed in again, I thought I heard a voice — not Elyne’s, not mine.\n\n> “Restart.”"
    },
    {
      "number": 5,
      "title": "The Price of Return",
      "content": "I gasped awake in the same place — the same street, the same sunlight. But something was off.\n\nThe people were smiling differently. Their faces felt wrong, like actors wearing the wrong expressions.\n\nAnd when I looked into the shop window, I saw my reflection — except it wasn’t me. My eyes glowed faintly blue.\n\nEvery reset changed something.\n\nNot just the world — me.\n\nThe pendant hummed softly in my pocket, warm against my skin. Elyne’s voice echoed faintly in my head, like a memory caught between worlds.\n\n> “Don’t forget who you are, even when the world does.”\n\nFor the first time, I wondered if surviving this curse meant losing myself along the way."
    },
    {
      "number": 6,
      "title": "Threads of Memory",
      "content": "I began keeping a journal. Each time I died, I wrote everything I could remember — people, places, even smells. But the words never stayed. Every reset wiped the pages clean.\n\nExcept one entry.\n\n> \"She dies if I don’t find the clock tower.\"\n\nI didn’t remember writing it. The handwriting wasn’t even mine.\n\nThe tower stood at the city’s center, unreachable by foot — or maybe the world just didn’t want me to reach it. The streets changed each loop, the alleys bent in impossible ways. Yet, somehow, I always ended up there, staring at the same locked gate.\n\nBehind it, I could hear ticking. Slow. Endless. Counting down to something I didn’t understand."
    },
    {
      "number": 7,
      "title": "Echoes in the Clock Tower",
      "content": "When I finally found a way inside, the city was burning.\n\nThe tower’s gears turned slowly, grinding like teeth. Smoke rose from the streets below, and screams echoed through the air. Elyne was there, waiting at the top, her hair whipping in the wind.\n\nShe smiled, even as the world around us cracked apart.\n\n“You found me,” she said softly.\n\nThen the shadow appeared again — not behind her, but inside her, crawling out through her reflection in the tower’s glass.\n\nI reached for her, but my hand passed through. The last thing I saw was her eyes — silver, filled with tears — before the world shattered once more.\n\nAnd I woke up to the same clear sky."
    },
    {
      "number": 8,
      "title": "The Sin of Remembering",
      "content": "I stopped counting how many times I’d died.\n\nThe loops blurred together. Some ended quickly, others stretched for days, but they all led to the same place — loss.\n\nEach time, Elyne remembered a little more. Each time, I lost a little more of myself.\n\nThe pendant had cracked. The glow inside it flickered weakly, like a dying flame. I could feel something slipping away — not just time, but meaning. The city felt hollow now, like it was waiting for me to forget.\n\nThat night, I dreamed of the clock tower again. The ticking was louder. And when I looked up, I saw a shadow standing in the gears, watching me.\n\n> “You’ve died too many times.”\n\nThe voice sounded like mine."
    },
    {
      "number": 9,
      "title": "The Day the Loop Broke",
      "content": "When I woke up, everything was different.\n\nThe sun hung lower in the sky. The streets were empty. Even the air felt wrong — still, heavy, like a painting that refused to move.\n\nI ran to the square, to the fountain where I first met Elyne, but the water was gone. In its place stood the pendant, glowing softly on the stone.\n\nI reached for it. The moment my fingers touched it, pain surged through me — burning, tearing, like my soul was being rewritten.\n\nI saw every loop, every death, every mistake, collapsing into one.\n\n> “You were never supposed to survive,” a voice said.\n\nWhen I opened my eyes, the world was gone. Only a single phrase remained, echoing in the dark:\n\n> “Restart from zero.”"
    },
    {
      "number": 10,
      "title": "The World Beyond the Reset",
      "content": "The next time I woke, it wasn’t in the city.\n\nI stood in a white field, beneath a sky filled with clock hands that moved backward. Every tick sent ripples through the ground, rewriting the world in reverse.\n\nElyne was there, sitting beside me. She smiled faintly, though her body was fading around the edges.\n\n“You did it,” she said. “You reached the end.”\n\nI wanted to ask what that meant, but when I blinked, she was gone — and the pendant lay shattered at my feet.\n\nA new voice echoed through the air.\n\n> “The loop has ended. The cycle begins anew.”"
    },
    {
      "number": 11,
      "title": "The City That Forgot Time",
      "content": "When I returned, the world was almost the same — almost.\n\nThe city was brighter, cleaner, as if the past had been rewritten. But no one recognized me. The people I’d known looked through me as if I were a ghost.\n\nI wandered for days, trying to find Elyne, but her name didn’t exist anymore. The pendant’s remains were gone. Even the clock tower had vanished from the skyline.\n\nOnly I remembered what had happened.\n\nOr maybe I didn’t.\n\nEvery time I tried to recall her face, it blurred. Every time I tried to speak her name, the sound vanished from my throat.\n\nI was alive — but in a world that no longer remembered I existed."
    },
    {
      "number": 12,
      "title": "The Memory of Tomorrow",
      "content": "I started seeing her in dreams again.\n\nSometimes, she stood in the fog. Sometimes, she sat by the fountain, smiling softly as if nothing had happened. But every time I tried to reach her, the world reset — not with death, but with silence.\n\nIt wasn’t the same power. This was different — slower, deliberate. Someone else was resetting the world now.\n\nAnd when I woke, I found a letter waiting by my bedside.\n\n> 'Do you want to start again?'\n\nBeneath the words was a drawing of a broken clock.\n\nI didn’t know who left it. But I knew, deep down, that answering yes would mean losing everything — again."
    },
    {
      "number": 13,
      "title": "The Final Reset",
      "content": "I burned the letter.\n\nThe ashes didn’t fall. They floated upward, shimmering in the dim light until they formed the shape of a clock — one hand missing, frozen at zero.\n\nThe city trembled. Time stuttered.\n\nI could feel it pulling at me again, trying to drag me back into the loop. But this time, I resisted. I remembered Elyne’s words, the warmth in her voice, the light of the pendant that had guided me this far.\n\n> “Even if everything resets, what you choose still matters.”\n\nI took one step forward, and the world cracked apart like glass. The gears of time screamed. For once, I didn’t fall.\n\nI walked through the breaking world, toward the sound of ticking.\n\nAnd when I reached the center, I smiled.\n\n> “This time, I’ll start on my own terms.”"
    },
    {
      "number": 14,
      "title": "Epilogue — Restart",
      "content": "The sky was clear again.\n\nA gentle breeze brushed across the street, carrying the scent of flowers. People laughed, children ran, and everything looked like it should have — peaceful, ordinary.\n\nI stood there quietly, hands in my pockets, watching them pass by.\n\nThe pendant was gone. The loops had ended. But as I reached into my coat, I felt something cold against my fingers — a small, cracked gear, faintly glowing blue.\n\nI smiled.\n\nMaybe this wasn’t the end. Maybe it never would be.\n\nAfter all, every story has to start somewhere.\n\n> Restarting from zero, one last time."
    }
  ]
}
